offline/OpenFOAM/incompressible/simpleFoam/pitzDaily/system/ITHACAdict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      ITHACAdict;
}

// EigenValue solver, can be eigen or spectra
EigenSolver eigen;

// Number of modes to output and to use for projection
NmodesU 5;
NmodesP 5;
NmodesSUP 5;
NmodesNut 5;
NmodesProject 5;

// eddy viscosity coefficients computation method
viscCoeff RBF;
//viscCoeff L2;

// Output format to save market vectors.
OutPrecision 20;
OutType fixed;

// Specific problem of a stationary case
tolerance 1e-5;

// Export Reduced Matrices
exportPython 0;
exportMatlab 0;
exportTxt 1;

bcMethod lift;

POD_U L2;
POD_p L2;
POD_Usup L2;

normalizationNorm L2;
